from random import choice

jokes_about_programmers = [
    "Чому програмісти так люблять книги фентезі? Там завжди є магія і немає помилок!",
    "Як програміст пише повідомлення своїй коханій? 'Привіт, Cвіт! Чи станеш ти моєю Валентинкою?'",
    "Чому програмісти погані у відносинах? Тому що вони завжди шукають ідеальний 'match'.",
    "Що говорить програміст, коли йде спати? 'while (!asleep) sheep++.'",
    "Що говорить програміст, йдучи з вечірки? 'Ctrl + Alt + Delete.'",
    "Як програмісти дізнаються про майбутнє? Вони дивляться в консоль.",
    "Як програміст відзначає свій день народження? 'int age = 0; age++; З Днем Народження!'",
    "Чому програмісти погано грають у покер? Вони завжди роблять 'flush'.",
    "Знаєте чому програмісти не люблять грати в приховану гру 'Хованки'?"
    "Тому що добре знають, що кожна гра закінчується 'Not Found'.",
    "Як програмісти вирішують суперечки? Шляхом 'code review'.",
    "Чому програмісти люблять гори? Там завжди є 'high-level' вид.",
    "Що говорить програміст, потрапивши в дорожній затор? 'Oops, it's a deadlock!'",
    "Як програміст прибирає будинок? 'delete mess;'"
]


def get_joke():
    return choice(jokes_about_programmers)
